#1：什么是序列：(有序的元素集合)就是存放元素的数据容器，列表，元组，字符串都是序列
#2：什么是切片：从序列按照指定范围，取出一部分元素形成一个新的序列

#基本语法 序列【开始索引：结束索引：步长】注意事项：切片操作的区间是左闭右开
#注意事项：1起始索引默认为0，结束索引默认截取到末尾，步长默认为1
#注意事项：2当起始索引大于结束索引时，步长必须为负数，否则结果为空列表
list1 = [10,20,30,40,50,60,70,80,90,100]
res = list1[0:5:1]
res2 = list1[1:8:2]
res3 = list1[1:8:3]
res4 = list1[::]
res5 = list1[:999:]
res6 = list1[3::]
res7 = list1[::4]
res8 = list1[7:2:-1]
print(res8)

t1 = (10,20,30,40,50,60,70,80,90,100)
print(type(list1))
print(type(t1))
res11 = t1[2:5:2]
print(res11)

str1 = 'welcome to learn python'
res12 = str1[2:9:2]
print(res12)
