"""
字典：就是用来存放一组键值对数据,可通过键(key) 对值(value)进行增删改查
特点:
1:用{}包裹，每个元素之间用逗号分割，每个元素的格式为key:value
2:字典中的key不能重复，不然后面的value的会覆盖前面的
3:字典中key必须是不可变类型的，但是value可以是任意类型的
4：字典是可以嵌套的
"""
d1 = {'张三':18,'李四':20,'王五':22,'张三':24} #当一个键被重复使用后，后面的会覆盖前面的
#定义空字典
d2 = {}
d3 = dict()
print(type(d1),d1)
print(type(d2),d2)
print(type(d3),d3)
d4 = {10:72,'李四':20}
d5 = {('hello','python'):20}
# d6 = {['hello','python']:20}#不可
print(type(d4),d4)
print(type(d5),d5)
# print(type(d6),d6)
stu = {
    260301 : {
        'id': '张三',
        'age': 18,
        'hobby': {}
    }
}
stu = {
    260301:{
        '姓名':'张三',
        '年龄':18,
        '爱好':{}
          }
}
